[
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7422364562756288512/",
    "post_id": 7422364562756288512,
    "engagements": 205,
    "impressions": 12953,
    "comments": 5,
    "reposts": 5,
    "reactions": 195,
    "engagement_rate": 1.58,
    "post_format": "Image",
    "posted_at": "2026-01-28 00:00:00",
    "week": "2026-01-26 00:00:00",
    "text": "We're in Vegas this week for our global Sales Kick-Off.\n\nThe energy in the room is incredible.\n\nTeams from EMEA, North America, APAC, and partners are all here with one focus: how do we take what worked in 2025 and scale it properly?\n\nThis year's theme is Next Level. Because we had a strong year, but strong isn't the same as scalable. So the sessions we’re attending this week are all about execution. \n\nWhat does better look like? How do we raise the bar internally to build stronger relationships internally and externally? How do we react and build faster? How do we sharpen the way we engage with our customers?\n\nThese few days create the alignment that makes everything else possible.\n\nWhen you're running distributed teams, it's too easy for priorities to drift or for regions to start solving the same problems differently. Getting everyone together resets that. \n\nIt reminds us we're building something bigger than any one market can deliver alone.\n\nIt's the same principle we talk about with customers evaluating workforce systems — you can't scale well when your foundation is fragmented.\n\nThe conversations happening here aren't just about this quarter. They're about building the kind of momentum that compounds over time.\n\nThat's what matters.\n\nI’m incredibly grateful to be working with this team.\n\nLet’s take this to the Next Level!"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7420422539941834753/",
    "post_id": 7420422539941834753,
    "engagements": 171,
    "impressions": 8411,
    "comments": 5,
    "reposts": 1,
    "reactions": 165,
    "engagement_rate": 2.03,
    "post_format": "Image",
    "posted_at": "2026-01-23 00:00:00",
    "week": "2026-01-19 00:00:00",
    "text": "If I were buying an HCM platform for the first time today, I'd spend less time on feature comparisons, and more time on lived reality.\n\nHere are the questions I’d ask:\n\n1. How often will this data be trusted without verification? \n2. Who owns issues when HR, Finance, and IT priorities collide? \n3. What happens when something changes at scale?\n\nEarly in buying processes, it's easy to focus on what's visible: dashboards, roadmaps, promises.\n\nWhat matters later is what's invisible.\n\nHow many handoffs exist behind the scenes, how exceptions are handled, and whether leaders can rely on one version of the truth (or still reconciling three different reports).\n\nI'd also push harder on understanding change, not just capability.\n\n→ How long before teams feel confident? \n→ What does adoption actually look like six months in? \n→ Where have others underestimated the effort?\n\nThe goal when investing in a new HCM platform isn’t to avoid complexity. \nIt's to avoid unnecessary complexity.\n\nThis is why Dayforce is built as a single, unified platform on one database.\n\nWhen there's one source of truth, trust doesn't require verification. \n\nWhen HR, Finance, and IT are working from the same foundation, ownership of issues becomes clearer. \n\nWhen exceptions are handled within one system instead of across six, they don't escalate the same way.\n\nThe right questions early on save months later. \nBut the right foundation answers most of them before they become problems.\n\nIf you’re evaluating an HCM platform for the first time (or if your current platform is complicating your priorities), let me know. \n\nWe can run through these questions together."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7422774235837882368/",
    "post_id": 7422774235837882368,
    "engagements": 140,
    "impressions": 6204,
    "comments": 3,
    "reposts": 0,
    "reactions": 137,
    "engagement_rate": 2.26,
    "post_format": "Image",
    "posted_at": "2026-01-29 00:00:00",
    "week": "2026-01-26 00:00:00",
    "text": "Before we talked about execution, we ran through Vegas solving problems as a team.\n\nSometimes alignment happens outside the conference room.\n\nAhead of officially starting Dayforce’s SKO in Vegas, we spent the day on personal development and wrapped it with a team competition — an EMEA team scavenger hunt on Fremont Street.\n\nDifferent challenge, different energy, but exactly what the team needed. \nThe session this morning was everything I hoped it would be.\n\nThe energy was sharp, the conversations were honest, and the alignment on where we're pushing this year is clear.\n\nWhen you bring teams together like this, you're reminded why it matters. Not just for the strategy sessions, but for the moments in between. The scavenger hunt probably did more for team cohesion than any slide deck could.\n\nWe're deep into the full kickoff with the broader organisation for the rest of the week.\n\nReady to see what this team builds in 2026!"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7423736066450300928/",
    "post_id": 7423736066450300928,
    "engagements": 38,
    "impressions": 4372,
    "comments": 1,
    "reposts": 0,
    "reactions": 37,
    "engagement_rate": 0.87,
    "post_format": "Image",
    "posted_at": "2026-02-01 00:00:00",
    "week": "2026-01-26 00:00:00",
    "text": "When leaders say they need \"better workforce visibility,\" they rarely mean dashboards.\n\nThe problems are usually far more important: \n\nThey mean: \"I'm making workforce decisions with data that's already two weeks old\".\nThey mean: \"I can't see problems until they've already cost us money\"\nThey mean: \"By the time I know we're overstaffed in one region and understaffed in another, the quarter's already halfway done\".\n\nVisibility isn't about having more reports. It's about having information early enough to actually do something with it.\n\nThe gap between \"what happened last month\" and \"what's happening right now\" is where most workforce problems either get solved or get expensive.\n\nCan you see labour costs tracking over budget in real time, or do you find out at month-end? Can you spot scheduling gaps before shifts go unfilled? Can you identify which sites are burning through overtime before it becomes a pattern?\n\nThis is why Dayforce is built for real-time workforce insights, not lagging reports.\n\nWhen someone clocks in, labour cost updates immediately. When a schedule changes, visibility across the organisation updates instantly. When performance trends shift, leaders see it while there's still time to respond.\n\nBetter visibility isn't simply about seeing more data. It's about seeing the right data early enough to make better decisions."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7421500916853288960/",
    "post_id": 7421500916853288960,
    "engagements": 68,
    "impressions": 3936,
    "comments": 1,
    "reposts": 1,
    "reactions": 66,
    "engagement_rate": 1.73,
    "post_format": "Image",
    "posted_at": "2026-01-26 00:00:00",
    "week": "2026-01-26 00:00:00",
    "text": "Everyone says they want \"one source of truth\" until you ask them a simple question:\n\n\"When headcount changed last quarter, how long did it take for payroll, finance, and operations to align on the actual number?\"\n\nAt scale — think 10,000+ employees across regions — that question exposes everything.\n\nIf the answer involves phrases like \"we’ll have to reconcile the numbers\" or \"depends which system you're looking at,\" you don't have one source of truth. You have multiple versions of truth that someone is manually aligning every month.\n\nThe cost of that isn't just time. It's confidence.\n\nWhen your CFO is making workforce investment decisions and your VP of HR is reporting different headcount to the board, trust erodes fast. When operations can't get accurate labour cost per site without pulling three reports and building a spreadsheet, planning slows down.\n\n\"One source of truth\" isn't a nice-to-have or a feature. It's an architecture neccesity.\n\nThis is why Dayforce is built on a single database, not modules stitched together on different datasets and linked with manual workarounds.\n\nWhen payroll processes, finance sees it immediately. When someone's hired in one region, global reporting updates in real time. When compensation changes, it flows through to forecasting without manual uploads.\n\nAt enterprise scale, \"one source of truth\" means nobody's reconciling data that should already match."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7425459284324319232/",
    "post_id": 7425459284324319232,
    "engagements": 120,
    "impressions": 3764,
    "comments": 2,
    "reposts": 2,
    "reactions": 116,
    "engagement_rate": 3.19,
    "post_format": "Image",
    "posted_at": "2026-02-06 00:00:00",
    "week": "2026-02-02 00:00:00",
    "text": "Thoma Bravo completed the acquisition of Dayforce this week. The world's largest software investor just put $12.3 billion behind our single vision.\n\nFor EMEA, this changes nothing about how we show up for customers, and everything about what we can now build. \n\nThe foundation was already strong. A single, unified platform. AI-powered. Built for the complexity that frontline-heavy organisations actually face.\n\nNow, with Thoma Bravo's backing, we're positioned to scale faster, invest deeper in innovation, and expand our reach across markets that have been waiting for a platform like this.\n\nDemand for intelligent, unified workforce technology isn't slowing down, it's accelerating quickly. Organisations need systems that can handle AI responsibly, deliver real-time insights, and make work life genuinely better for employees.\n\nThat's what Dayforce already does… and now we have the resources to do it at an even bigger scale.\n\nFor our customers, our team, and the market across EMEA, this isn't just an acquisition.\nIt's validation that the way we've built Dayforce (unified, AI-enabled, designed for real workforce complexity) is exactly where the industry needs to go.\n\nThe next chapter is just beginning."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7422923544487055360/",
    "post_id": 7422923544487055360,
    "engagements": 59,
    "impressions": 3451,
    "comments": 2,
    "reposts": 1,
    "reactions": 56,
    "engagement_rate": 1.71,
    "post_format": "Image",
    "posted_at": "2026-01-30 00:00:00",
    "week": "2026-01-26 00:00:00",
    "text": "Burton Snowboards calls their old setup \"HR soup”. \n\nIt’s a really good description of the pain most of our clients feel when they come to us.\n\nDifferent platforms for payroll, recruiting, benefits, time tracking, employee surveys. Systems that varied by country. No single source of truth.\n\nThe snowboard company needed everything working smoothly as they scaled, but instead, their people and culture team was drowning in administration.\n\nManagers spent two months every year in a \"spreadsheet nightmare\" just managing compensation reviews. Employees logged into five or six different systems to access basic information. Payroll processing took too long, and when errors happened, finding them was painful.\n\nThey needed one unified system that could handle a complex, global workforce. \nThat's where Dayforce came in.\n\nNow, payroll processing takes significantly less time. Managers run global reports for workforce planning. Employees access everything from pay stubs to schedules and award letters, all in one place.\n\nThe people and culture team shifted from admin to what actually matters: employee development and growth.\n\nWhen your foundation is solid, your teams can focus on the work that drives the business forward. As per their SVP of People and Culture: \"We used to spend about two months a year in a spreadsheet nightmare. Dayforce has accounted for all those variables and made that much more efficient and accurate.\"\n\nSounds like a pretty simple solution to replace firefighting systems that should just work.\n\nIf you want to learn more about how we helped Burton solve their HCM headaches, check out the link in my comments below. \n\nAnd if you’re facing similar challenges, let’s connect."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7424369664467660800/",
    "post_id": 7424369664467660800,
    "engagements": 60,
    "impressions": 3018,
    "comments": 2,
    "reposts": 0,
    "reactions": 58,
    "engagement_rate": 1.99,
    "post_format": "Image",
    "posted_at": "2026-02-03 00:00:00",
    "week": "2026-02-02 00:00:00",
    "text": "The AI conversation in HR has become almost useless.\n\nEveryone's talking about it. Most of it is vague promises, fear-mongering, or vendor pitches dressed up as thought leadership.\n\nHere's the only question that actually matters:\n\nWhere does time disappear in your organisation, and can technology give it back?\n\nIn workforce-heavy environments, I see time vanish in the same predictable patterns. \n\n-> Manually adjusting schedules because the system can't handle exceptions. Reconciling pay discrepancies that shouldn't exist. \n\n-> Hunting for information across five different systems. \n\n-> Managing manual workarounds that have become \"just how we do things here.\"\n\nThis is where Dayforce’s approach of People + AI delivers real value, not by replacing jobs or reinventing how work happens, but by closing the gap between a problem and a solution.\n\nOur AI gives users the ability to skip all the searching, the menus and the red tape to get quick answers by simply asking “I need my pay slips”, “When is my next shift?” or “I want to take leave next month.”\n\nWhen leaders get clearer visibility, people get better experiences.\nWhen teams spend less time on admin, they spend more time on work that matters.\nWhen the basics run smoothly, trust builds without anyone needing to announce it.\n\nThe organisations I see moving fastest aren't the ones with the flashiest AI strategy decks. \n\nThey're the ones systematically and realistically removing friction from daily work using this amazing tech."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7424054497959661568/",
    "post_id": 7424054497959661568,
    "engagements": 65,
    "impressions": 2729,
    "comments": 3,
    "reposts": 0,
    "reactions": 62,
    "engagement_rate": 2.38,
    "post_format": "Image",
    "posted_at": "2026-02-02 00:00:00",
    "week": "2026-02-02 00:00:00",
    "text": "Organisations don't usually fail at workforce transformation because they lack budget or executive support. They fail because nobody agreed on what success actually looks like.\n\nThe plan gets approved. The sponsor is named. The systems are selected. But then basic questions expose the gaps:\n\nWho owns the outcome when something breaks? How do we decide when HR, Finance, and IT want different things? Are we willing to standardise processes, or does every department get to customise?\n\nThose aren't planning questions. They're alignment questions, and they determine whether you can actually execute when pressure hits.\n\nThis is what we focus on with organisations considering Dayforce, long before we ever talk about features or implementation timelines.\n\nBecause here's what forces alignment: a single, unified platform built on one database with AI that makes work easier for employees, planning simpler for HR, and insights clearer for executives.\n\nWhen everyone's working from the same foundation, the ambiguity that kills most implementations doesn't have room to hide. \n\nThe teams that move quickly aren't rushing. They've done the hard work of getting clear on what good looks like. They're honest about where complexity adds value versus creating noise. \n\nThese teams accept that successful implementations aren't about perfection, they're about being able to make decisions together when trade-offs appear, whereas the organisations that struggle may have all the resources, but they're missing that shared foundation.\n\nIf you're evaluating workforce systems this year, the most important question shouldn’t be whether you have budget or capacity for transformation. \n\nIt's whether you're prioritising alignment between all of your stakeholders, or whether you’re happy to stick with the cost of fragmented tech and systems for another year."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7421838251558170625/",
    "post_id": 7421838251558170625,
    "engagements": 49,
    "impressions": 2685,
    "comments": 1,
    "reposts": 0,
    "reactions": 48,
    "engagement_rate": 1.82,
    "post_format": "Image",
    "posted_at": "2026-01-27 00:00:00",
    "week": "2026-01-26 00:00:00",
    "text": "If it takes your leadership team more than 60 seconds to answer basic workforce questions, you don't have a data problem.\n\nYou have a systems problem.\n\n\"What's our actual labour cost per site right now?\" or \"How many people are scheduled to work this weekend across operations?\"\n\nAnd the room goes quiet for a second, and then everybody scrambles to check their spreadsheets and make some quick calculations. \n\nNot because nobody knows how to find the answer, but because getting it requires pulling three different reports, reconciling two systems, and hoping the data was updated this morning.\n\nAt scale, this happens constantly.\n\nWhen your workforce data lives in separate systems for HR, payroll, and scheduling, even basic questions become projects. By the time you have the answer, the conversation has moved on. Or worse, the decision gets made without it.\n\nThis is exactly what Dayforce's AI is designed to solve.\n\nBecause it's built on a single database, you can ask: \"Show me overtime trends across EMEA for the last 90 days\" or \"Which sites are running over their labour budget this month?\", and get answers in seconds, not days.\n\nThe AI doesn't need to reconcile multiple sources, because there's only one source.\n\nThat's the difference between workforce data you can actually use to make decisions and workforce data that just creates more work.\n\nWhen your systems are unified, simple questions get simple answers."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7418952594917613568/",
    "post_id": 7418952594917613568,
    "engagements": 41,
    "impressions": 2567,
    "comments": 0,
    "reposts": 1,
    "reactions": 40,
    "engagement_rate": 1.6,
    "post_format": "Text Only",
    "posted_at": "2026-01-19 00:00:00",
    "week": "2026-01-19 00:00:00",
    "text": "When I talk to a client struggling with WFM, they don't usually say \"the systems are broken.\"\n\nThey say \"everything just feels harder.\"\n\nThat's when I start paying attention to where the friction is actually showing up.\n\nManagers stretched thin dealing with exceptions instead of leading their teams. Small issues that used to get resolved quickly now escalate. People spending more time fixing problems than preventing them. Decisions slowing down because nobody fully trusts the data.\n\nIt's rarely one obvious failure. It's the accumulation of small friction points that compound over time.\n\nThe instinct when things feel heavy is to push harder. But in my experience, pressure just reveals weak foundations, it doesn't fix them.\n\nWhat works is pausing to remove the friction. Simplify where things got unnecessarily complex. Stabilise what's breaking. Clarify what's become confusing.\n\nWhen you do that, capacity comes back. Not because people are suddenly working more, but because they're no longer carrying unnecessary weight.\n\n\"Everything feels harder\" is usually a symptom, not the actual problem.\n\nAnd recognising that changes how you respond."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7426566495159226368/",
    "post_id": 7426566495159226368,
    "engagements": 38,
    "impressions": 734,
    "comments": 0,
    "reposts": 1,
    "reactions": 37,
    "engagement_rate": 5.18,
    "post_format": "Image",
    "posted_at": "2026-02-09 00:00:00",
    "week": "2026-02-09 00:00:00",
    "text": "You can tell when a team is ready to perform at the next level.\n\nIt's not what they say in the room… it's how they show up for each other.\n\nWe recently wrapped our global Sales Kick-Off in Vegas. The stage was great, and the strategy sessions were sharp. But what stood out to me most wasn't what happened on the agenda.\n\nIt was our team.\n\nEMEA showed up differently this year. Engaged, yes, but more than that. Supportive. Celebrating each other's wins openly. Pushing each other forward instead of just showing up to listen.\n\nSeveral leaders from other regions commented on it. The sense of community. The energy our team brought to the room.\n\nThat's the signal that matters to me most as a leader.\n\nBecause \"next level\" isn't just about hitting bigger numbers or executing faster. It's about whether your team actually believes they can do it together, and whether they want to.\n\nWe've spent the last year building something special by investing in the right people. We encouraged successful people to help newer people get there. We created space for honest conversations when things weren't working.\n\nThat work showed up big time in Vegas.\n\nGrateful to my whole for building EMEA to the team it is today! Let’s keep building."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7320785671357423616/",
    "post_id": 7320785671357423616,
    "engagements": 182,
    "impressions": 6178,
    "comments": 7,
    "reposts": 2,
    "reactions": 173,
    "engagement_rate": 2.95,
    "post_format": "Image",
    "posted_at": "2025-04-23 00:00:00",
    "week": "2025-04-21 00:00:00",
    "text": "Thrilled to see Dayforce representing at HR Tech in London! Special visit from our President, Steve Holdridge - appreciate all of the support for our EMEA customers and Daymakers.\n\nCome see us!!\n\n#makeworklifebetter\n#oneplatform #paytimeHRanalytics"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7329043662779084800/",
    "post_id": 7329043662779084800,
    "engagements": 209,
    "impressions": 6433,
    "comments": 25,
    "reposts": 0,
    "reactions": 184,
    "engagement_rate": 3.25,
    "post_format": "Text Only",
    "posted_at": "2025-05-16 00:00:00",
    "week": "2025-05-12 00:00:00",
    "text": "Congratulations to the Class of 2025!!!\nI am thrilled to see the level of talent, enthusiasm & purpose you bring to the world. I am beyond proud of my daughter Simone Bello- the world is your oyster- keep making the most of it!!"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7330228302336397313/",
    "post_id": 7330228302336397313,
    "engagements": 150,
    "impressions": 3490,
    "comments": 4,
    "reposts": 1,
    "reactions": 145,
    "engagement_rate": 4.3,
    "post_format": "Image",
    "posted_at": "2025-05-19 00:00:00",
    "week": "2025-05-19 00:00:00",
    "text": "Oh my- what an experience it was!  Last week we hosted over 400 people to discuss, connect, and celebrate Dayforce.  Our London Summit was a smashing success - it was wonderful sharing the latest about our AI Powered People Platform & how our brand promise comes to life.  \n\nThank you David Ossip & Jason G. for an amazing demonstration of our solution & the quantifiable value it brings!\n\nWell done Eric Glass- sharing all things #AI\n\nCustomers & partners- thank you- cannot wait until the next time. We appreciate you.\n\nDayforce makes work life better."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7333394603380793345/",
    "post_id": 7333394603380793345,
    "engagements": 41,
    "impressions": 1631,
    "comments": 1,
    "reposts": 0,
    "reactions": 40,
    "engagement_rate": 2.51,
    "post_format": "Image",
    "posted_at": "2025-05-28 00:00:00",
    "week": "2025-05-26 00:00:00",
    "text": "Hubexo has chosen Dayforce for the next phase of their workforce transformation! 🎉  \n\nWith our single AI-powered people platform, Dayforce will help this global leader in construction technology unlock their full workforce potential, operate with confidence, and realise quantifiable value. \n\nRead the announcement: https://lnkd.in/eKhrfsKQ"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7341127647604690946/",
    "post_id": 7341127647604690946,
    "engagements": 190,
    "impressions": 6664,
    "comments": 21,
    "reposts": 2,
    "reactions": 167,
    "engagement_rate": 2.85,
    "post_format": "Image",
    "posted_at": "2025-06-18 00:00:00",
    "week": "2025-06-16 00:00:00",
    "text": "We have just concluded our EMEA Dayforce Mid Year Meeting.  Our content centered around talent, technology and AI (to name a few!). I walk away being super excited for our customers and our EMEA Daymakers… we have that winning culture!!  \n\nBig thank you to the team, presenters and Eddy South!!\n\n#makeworklifebetter\n#YMCA😀"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7348815874650198018/",
    "post_id": 7348815874650198018,
    "engagements": 115,
    "impressions": 10115,
    "comments": 3,
    "reposts": 24,
    "reactions": 88,
    "engagement_rate": 1.14,
    "post_format": "Article",
    "posted_at": "2025-07-09 00:00:00",
    "week": "2025-07-07 00:00:00",
    "text": "Hello amazing network!\nI am looking for the next incredible leader to join our world class UKI team here, at Dayforce. If you have passion, a track record of Enterprise sales leader success and want to join our mission for growth- check this out.\n\n#makeworklifebetter\n#12to1\n#dotheworkyouaremeanttodo"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7351525522067054592/",
    "post_id": 7351525522067054592,
    "engagements": 8,
    "impressions": 837,
    "comments": 1,
    "reposts": 0,
    "reactions": 7,
    "engagement_rate": 0.96,
    "post_format": "Article",
    "posted_at": "2025-07-17 00:00:00",
    "week": "2025-07-14 00:00:00",
    "text": "New EU rules are about to change how you handle pay transparency. Are you ready? Find out what the directive means for your business and how to prepare now with practical steps we've highlighted in our most recent Dayforce blog. We’re also hosting a webinar on 18 July to explore what the changes mean in practice and how to take action with confidence. https://lnkd.in/ek-JqGVZ"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7353808870223355907/",
    "post_id": 7353808870223355907,
    "engagements": 19,
    "impressions": 771,
    "comments": 0,
    "reposts": 0,
    "reactions": 19,
    "engagement_rate": 2.46,
    "post_format": "Image",
    "posted_at": "2025-07-23 00:00:00",
    "week": "2025-07-21 00:00:00",
    "text": "Joyful, open-hearted leadership is empowering and transformative, and it’s never been more in demand. Join Tracee Ellis Ross to learn why leading with joy makes work life better.  \n\nRegister for Dayforce Discover: https://lnkd.in/e8vJ3Vng\n\n#DayforceDiscover"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7353068817058578432/",
    "post_id": 7353068817058578432,
    "engagements": 16,
    "impressions": 856,
    "comments": 1,
    "reposts": 1,
    "reactions": 14,
    "engagement_rate": 1.87,
    "post_format": "Video",
    "posted_at": "2025-07-21 00:00:00",
    "week": "2025-07-21 00:00:00",
    "text": "Blatchford believes that enhancing employee experience leads to better patient outcomes. \n\nTheir people-first approach, supported by the Dayforce AI-powered people platform, improves global HR alignment and boosts employee recruiting and retention.\n\nCheck out how this leader in advanced prosthetics prioritizes its people, allowing them to focus on what they do best! https://lnkd.in/gV2kEhui "
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7367237163127635968/",
    "post_id": 7367237163127635968,
    "engagements": 63,
    "impressions": 6291,
    "comments": 2,
    "reposts": 5,
    "reactions": 56,
    "engagement_rate": 1.0,
    "post_format": "Article",
    "posted_at": "2025-08-29 00:00:00",
    "week": "2025-08-25 00:00:00",
    "text": "Thrilled to share that we are looking for some talented and motivated people to join our Dayforce EMEA team. Specific to this post, I am looking for our next DVP to lead our customer base sales organisation.\n\nPlease have a customer growth mindset and bring your passion to work everyday. Ping me with questions- otherwise- would love for you to apply."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7361877522877206529/",
    "post_id": 7361877522877206529,
    "engagements": 48,
    "impressions": 3263,
    "comments": 1,
    "reposts": 0,
    "reactions": 47,
    "engagement_rate": 1.47,
    "post_format": "Text Only",
    "posted_at": "2025-08-14 00:00:00",
    "week": "2025-08-11 00:00:00",
    "text": "With this exciting promotion announcement... we now have an open position for our Emerging segment where we support businesses between 500-1000 employees.  \n\nThis segment is fast, fun and rewarding. We support amazing customers and is a key growth area for Dayforce EMEA. \n\nLyndon Davies Sam Dennison  Contact Lyndon or Sam for more details! \n\nLet's go!!!"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7373285880242786308/",
    "post_id": 7373285880242786308,
    "engagements": 33,
    "impressions": 781,
    "comments": 1,
    "reposts": 0,
    "reactions": 32,
    "engagement_rate": 4.23,
    "post_format": "Image",
    "posted_at": "2025-09-15 00:00:00",
    "week": "2025-09-15 00:00:00",
    "text": "We are honoured to share that Dayforce is recognised as a Leader in the 2025 Gartner® Magic Quadrant™ for HCM Suites for 1,000+ Employee Enterprises for the 6th time in a row.\n \nGet complementary access to the report here https://lnkd.in/eXAztG6b"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7373601539036442624/",
    "post_id": 7373601539036442624,
    "engagements": 14,
    "impressions": 765,
    "comments": 0,
    "reposts": 0,
    "reactions": 14,
    "engagement_rate": 1.83,
    "post_format": "Article",
    "posted_at": "2025-09-16 00:00:00",
    "week": "2025-09-15 00:00:00",
    "text": "AI in the workplace isn’t a “someday” thing, it’s happening now. Join our Spotlight Series webinar to see how Dayforce AI can simplify work, boost decisions, and unlock your people’s full potential."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7379798873013239808/",
    "post_id": 7379798873013239808,
    "engagements": 497,
    "impressions": 11929,
    "comments": 66,
    "reposts": 0,
    "reactions": 431,
    "engagement_rate": 4.17,
    "post_format": "Image",
    "posted_at": "2025-10-03 00:00:00",
    "week": "2025-09-29 00:00:00",
    "text": "It finally arrived… today!!! First my citizenship, now my passport - just in time for Dayforce Discover in Vegas.  I love it when a plan comes together.\n\nGoing for fish & chips to celebrate tonight… \n\n#discover #makeworklifebetter #bluenailsreadytogo"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7386862136712675328/",
    "post_id": 7386862136712675328,
    "engagements": 172,
    "impressions": 8615,
    "comments": 11,
    "reposts": 2,
    "reactions": 159,
    "engagement_rate": 2.0,
    "post_format": "Image",
    "posted_at": "2025-10-22 00:00:00",
    "week": "2025-10-20 00:00:00",
    "text": "Wanted: Dayforce!\nOur SLT EMEA spent the day digging into our Q3 results and mapping out our finishing touches for a strong Q4. This teamwork, winning spirit and push for excellence fuels our success.\n\n98% customer retention\n7000th customer live on Dayforce\nOne system, the power of one\n\n#makeworklifebetter #gratitude"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7381392068423680000/",
    "post_id": 7381392068423680000,
    "engagements": 110,
    "impressions": 2900,
    "comments": 3,
    "reposts": 0,
    "reactions": 107,
    "engagement_rate": 3.79,
    "post_format": "Image",
    "posted_at": "2025-10-07 00:00:00",
    "week": "2025-10-06 00:00:00",
    "text": "“Great software needs great people”. \nPartner first… excellent session at Dayforce Discover\n\n#discover #dpn\nJeremy Johnson Chris Armstrong Sam Alkharrat Beata Reimer"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7382477204686917632/",
    "post_id": 7382477204686917632,
    "engagements": 80,
    "impressions": 2681,
    "comments": 2,
    "reposts": 0,
    "reactions": 78,
    "engagement_rate": 2.98,
    "post_format": "Image",
    "posted_at": "2025-10-10 00:00:00",
    "week": "2025-10-06 00:00:00",
    "text": "Technology + People = Acceleration \n\nDayforce Discover was an amazing experience!  Hearing about our suite of AI agents & discussing how the future is PEOPLE + AI.\n\nThank you partners and customers for spending time with us. We are taking our AI powered people platform to the next level!!\n\nSteve Holdridge \n#dayforce\n#dotheworkyourmeanttodo"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7383401607842910208/",
    "post_id": 7383401607842910208,
    "engagements": 32,
    "impressions": 1149,
    "comments": 1,
    "reposts": 0,
    "reactions": 31,
    "engagement_rate": 2.79,
    "post_format": "Image",
    "posted_at": "2025-10-13 00:00:00",
    "week": "2025-10-13 00:00:00",
    "text": "HR and payroll leaders face more complexity than ever – global compliance, admin overload, disconnected teams. \n\nAt Dayforce Discover 2025, we introduced new products designed to help overcome these challenges. See what’s new ➡️ https://lnkd.in/eQF4Tp6C"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7394095727116705792/",
    "post_id": 7394095727116705792,
    "engagements": 180,
    "impressions": 4082,
    "comments": 6,
    "reposts": 0,
    "reactions": 174,
    "engagement_rate": 4.41,
    "post_format": "Image",
    "posted_at": "2025-11-11 00:00:00",
    "week": "2025-11-10 00:00:00",
    "text": "Today we hosted our Dayforce Community Connect- over 300 customers attended, plus partners and delegates.\nOur success today was a true team effort. A big thank you to marketing and RDR (pictured), amazing customer success teams, sales organisation and the fantastic support from HQ!\nTopics:\n- People + AI is the magic\n- Innocent  Drinks and Canal & River Trust shared their key learnings and deliverables with Dayforce\n- Dayforce Flex Work- a top notch contingent workforce management \nsolution \n- Product innovations are purposeful & continue to enhance our single unified data architecture \n\nCustomers- you are at the heart of everything we do. Thank you, see you at our Summit in May!!\n\n#makeworklifebetter\n#people+AI"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7396880057752887296/",
    "post_id": 7396880057752887296,
    "engagements": 83,
    "impressions": 3821,
    "comments": 0,
    "reposts": 8,
    "reactions": 75,
    "engagement_rate": 2.17,
    "post_format": "Text Only",
    "posted_at": "2025-11-19 00:00:00",
    "week": "2025-11-17 00:00:00",
    "text": "Teamwork, culture, partnership- some things I take very seriously when building and leading a high performance team.\n\nNot only does it take top talent; it takes strong relationships, great listeners & the ability to create memorable experiences.\n\nI am looking for 2 new Account Executives to join Dayforce UKI (focussing on organisations between 500- 3500 employees). \n\nYou- are you prepared to take your career to the next level? \n\nOr perhaps you know someone you should nudge to think about this opportunity?\n\nI would love to hear from you, please send me a message.\n\n#makeworklifebetter #people+AI #HCM #bettertogether"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7391456154234826752/",
    "post_id": 7391456154234826752,
    "engagements": 14,
    "impressions": 1482,
    "comments": 0,
    "reposts": 0,
    "reactions": 14,
    "engagement_rate": 0.94,
    "post_format": "Text Only",
    "posted_at": "2025-11-04 00:00:00",
    "week": "2025-11-03 00:00:00",
    "text": "How amazing would it be to work for an organisation that has been named as a leader in Gartner’s Magic Quadrant for cloud based HCM solutions?\n\nPartner with customers to transform their business and apply AI with purpose…\n\nMake a difference… join Dayforce."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7391128818809409536/",
    "post_id": 7391128818809409536,
    "engagements": 13,
    "impressions": 1173,
    "comments": 0,
    "reposts": 0,
    "reactions": 13,
    "engagement_rate": 1.11,
    "post_format": "Text Only",
    "posted_at": "2025-11-03 00:00:00",
    "week": "2025-11-03 00:00:00",
    "text": "Another expansion role in our growing Emerging segment, focussing on organisations between 500-1000 employees.  Massive opportunity for you and Dayforce!!"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7396105895014993920/",
    "post_id": 7396105895014993920,
    "engagements": 14,
    "impressions": 799,
    "comments": 0,
    "reposts": 0,
    "reactions": 14,
    "engagement_rate": 1.75,
    "post_format": "Article",
    "posted_at": "2025-11-17 00:00:00",
    "week": "2025-11-17 00:00:00",
    "text": "Discover how seamless system integration drives efficiency and innovation. Join our Dayforce Spotlight Series webinar on Friday, 5 December, to see Dayforce Studio in action and learn how to unify your HR ecosystem for smarter, faster operations. #makeworklifebetter"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7392130153608478720/",
    "post_id": 7392130153608478720,
    "engagements": 6,
    "impressions": 582,
    "comments": 0,
    "reposts": 0,
    "reactions": 6,
    "engagement_rate": 1.03,
    "post_format": "Text Only",
    "posted_at": "2025-11-06 00:00:00",
    "week": "2025-11-03 00:00:00",
    "text": "Come meet the team… let’s discuss how we are leading the way with People+ AI"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7406304172867743744/",
    "post_id": 7406304172867743744,
    "engagements": 87,
    "impressions": 11470,
    "comments": 0,
    "reposts": 0,
    "reactions": 87,
    "engagement_rate": 0.76,
    "post_format": "Text Only",
    "posted_at": "2025-12-15 00:00:00",
    "week": "2025-12-15 00:00:00",
    "text": "I've worked in four different organisations across three continents.\n\nDifferent industries. Different markets. Different labour laws and workplace cultures. Same fundamental problems everywhere:\n\nTeams doing solid work while fighting systems that make everything harder than it needs to be. Schedules that change without warning and wreck people's plans. Payroll errors that kill trust faster than any bad manager could. Processes designed for someone's convenience, but never theirs.\n\nWhen the basics don't work (pay, time, visibility, the ability to grow) everything else becomes heavier than it should be.\n\nDayforce is built to solve exactly this. Not with surface fixes or band-aid/plaster integrations, but with a unified platform that large, complex, workforces can actually rely on when it matters.\n\nThis is why our EMEA expansion is so critical. These markets have high operational standards, diverse workforces, and realities that shift by the hour. \n\nIf we can make work fundamentally smoother here, we can make it smoother anywhere.\n\nBetter doesn't always look dramatic.\n\nSometimes it's just the quiet relief of a schedule that makes sense. A payslip that's accurate. A system that doesn't crash mid-shift. A manager who has time to lead instead of reconciling timesheets.\n\nThat's the work that matters to the people who matter the most to your business."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7407744163548512257/",
    "post_id": 7407744163548512257,
    "engagements": 74,
    "impressions": 10249,
    "comments": 2,
    "reposts": 0,
    "reactions": 72,
    "engagement_rate": 0.72,
    "post_format": "Text Only",
    "posted_at": "2025-12-19 00:00:00",
    "week": "2025-12-15 00:00:00",
    "text": "My role has changed a dozen times over the years.\n\nSales. Training. Sales leadership. Multi-function leadership across sales, marketing, BDR, partners, and services. Regional turnarounds. Cross-continental growth.\n\nBut one principle has stayed constant through every transition. \nLeadership is a practice, not a position.\n\nI don't lead the same way in every situation - context matters, culture matters, the specific challenges matter. But I try to lead in a way that gives people confidence in three core things, regardless of market or circumstance: \n\n1. They know what matters.\n\nClarity creates momentum. Uncertainty (even well-intentioned uncertainty) slows everything down and drains energy from the work that actually moves the business forward.\n\n2. They know they can speak openly.\n\nHonest conversations build organisations that improve and adapt. Silence, politeness, or fear just means you keep repeating the same problems under slightly different circumstances.\n\n3. They know I'll show up consistently.\n\nNot only when the results look good and everything's ahead of plan - especially when they don't and we need to find a different path forward.\n\nLeading across the US, UK, and Europe taught me that style and approach need to adapt to context. But the core expectations don't change. \n\nPeople want leaders who recognise their effort, respect their time, and make decisions with real intention and thought behind them.\n\nAs Dayforce grows across EMEA, I'm more aware than ever of the responsibility that comes with scale.\n\nPeople make it all possible. Make sure to treat them that way."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7407043077183262720/",
    "post_id": 7407043077183262720,
    "engagements": 134,
    "impressions": 6698,
    "comments": 13,
    "reposts": 0,
    "reactions": 121,
    "engagement_rate": 2.0,
    "post_format": "Text Only",
    "posted_at": "2025-12-17 00:00:00",
    "week": "2025-12-15 00:00:00",
    "text": "I learned something important about leadership when I moved from the US to Europe ten years ago - it doesn't travel on a passport.\n\nPace changes between markets. Expectations shift. Communication styles can be dramatically different… what reads as confident in Philadelphia can come across as aggressive in London or Berlin.\n\nBut underneath all of that, people want the same fundamental things from their leaders.\n\nClear direction so they know where they're going and why. Room to grow without having to fight for it. A leader who shows up when things get uncomfortable, not just when results look good. A workplace where the basics like pay and schedules can actually be trusted.\n\nWhat surprised me most about Europe is how much local context shapes every decision. You can't assume what works in London will work in Berlin, or that a playbook from Frankfurt will land the same way in Glasgow. \n\nDifferent labour laws, different work cultures, different expectations about everything from communication style to work-life balance.\n\nIt forces you to listen harder, adapt faster, and respect the operational realities and human stakes behind every choice you make. As Dayforce expands across EMEA, those lessons are front and centre for me every single day.\n\nTechnology matters deeply, but how people interact with it matters even more.\n\nNo two regions are identical. But the desire for work that's fair, predictable, meaningful and enables for growth…\n\nThat's universal."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7404869759596388352/",
    "post_id": 7404869759596388352,
    "engagements": 158,
    "impressions": 5303,
    "comments": 5,
    "reposts": 0,
    "reactions": 153,
    "engagement_rate": 2.98,
    "post_format": "Text Only",
    "posted_at": "2025-12-11 00:00:00",
    "week": "2025-12-08 00:00:00",
    "text": "I’ve always believed that meaningful work speaks for itself.\n\nI've spent many years growing and scaling underperforming regions, leading through mergers, and building high-engagement teams across three continents.\n\nBut recently, I realised something important. In the digital world we live in today, people can form an opinion about you long before you ever meet. \n\nAnd as Dayforce grows across the UK and Germany, the conversations we're having about People + AI, about frontline workforces, and about what actually drives results for HCM teams, deserve a wider table than the one we can physically sit around. \n\nSo this is me building a bigger table. \n\nI'm using this space to share what I've learnt leading teams across the US, UK, and Europe. The practical stuff. The parts that matter when you're trying to turn around a struggling business or scale through complexity.\n\nI’m not going to try to do the whole “guru” thing. \nI’m just going to share what's worked, what hasn't, and what I’ve leant along the way. \n\nIf you're new here, welcome.\nIf you've been here a while, thanks for the engagement…"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7405184685728796672/",
    "post_id": 7405184685728796672,
    "engagements": 69,
    "impressions": 3446,
    "comments": 5,
    "reposts": 0,
    "reactions": 64,
    "engagement_rate": 2.0,
    "post_format": "Text Only",
    "posted_at": "2025-12-12 00:00:00",
    "week": "2025-12-08 00:00:00",
    "text": "If you can't explain what your workforce technology actually does in under two minutes, it's probably not solving the right problems.\n\nHere's how I explain Dayforce when someone asks:\n\nWe take the parts of frontline work that absolutely can’t fail, and put them in one place.\n\n→ Pay that's accurate the first time. Because chasing down payroll errors destroys morale faster than almost anything I’ve seen in my whole career in this field.\n\n→ Schedules that respect both people and operations. Frontline teams need predictability so they can plan their lives. The business needs flexibility to respond to demand. You can't sacrifice one for the other - and most systems make you choose.\n\n→ Time tracking that doesn't require a detective. If your managers are spending half their week reconciling timesheets instead of leading people, something is fundamentally broken.\n\n→ Compliance that doesn't shatter every time a regulation changes. And regulations always change, especially across regions.\n\n→ Learning and mobility paths that actually strengthen your teams over time. Not tick-box training that nobody remembers three days later.\n\n→ Insights leaders can act on without stitching together twelve different reports from six different systems. If your workforce data lives in multiple places, you don't have data, you have a reconciliation problem.\n\nThis matters especially in organisations with large frontline workforces.\n\nIn a retail operation, a distribution centre, a hotel, a manufacturing plant… one missed punch or one flawed schedule isn't a small issue. It cascades quickly into cost overruns, frustrated teams, or service failures.\n\nWhen these fundamentals live in a single system, leaders can finally stop firefighting and start focusing on work that actually moves the business forward."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7406671506350637057/",
    "post_id": 7406671506350637057,
    "engagements": 57,
    "impressions": 3567,
    "comments": 2,
    "reposts": 2,
    "reactions": 53,
    "engagement_rate": 1.6,
    "post_format": "Text Only",
    "posted_at": "2025-12-16 00:00:00",
    "week": "2025-12-15 00:00:00",
    "text": "Most organisations think about HCM as an HR problem.\n\nThat's wrong, and it's expensive.\n\nWhen you're evaluating or changing workforce systems, the conversation might start in HR. But the top line and bottom line impact spreads across every function that touches people, money, or operations.\n\n1. HR needs fewer manual cycles and more time for strategic work. If your system creates noise instead of reducing it, they're stuck like heck in reconciliation instead of building culture or developing talent.\n\n2. IT wants clean architecture they can actually support. When your HCM has a unified data model, the support burden drops dramatically. When it's six vendors stitched together with brittle integrations, they're firefighting constantly and nothing ever gets better.\n\n3. Finance needs accuracy and predictability because labour is one of the most sensitive lines in any P&L. Small errors at the individual level compound fast when you're operating at scale across sites and shifts.\n\n4. Operations needs reliability. A shift pattern that actually works. A team that shows up when they're supposed to. The ability to adjust quickly when demand changes or something breaks (because something always breaks).\n\n5. If even one of these groups is struggling with your HCM system, the whole organisation feels it. Missed schedules cascade into service failures. Payroll errors destroy trust. Bad data leads to bad decisions.\n\nSo no, modern workforce technology isn't just an HR investment. It's a shared operational foundation for how work actually happens across your business. \n\nAnd if you want your business to prosper, you need to think ahead and realise that you can’t just keep one department happy - you need a system that works for all of them. \n\nOnce you realise that, send me a message and let’s get you onboarded on Dayforce."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7409343831193657344/",
    "post_id": 7409343831193657344,
    "engagements": 84,
    "impressions": 2210,
    "comments": 7,
    "reposts": 1,
    "reactions": 76,
    "engagement_rate": 3.8,
    "post_format": "Video",
    "posted_at": "2025-12-23 00:00:00",
    "week": "2025-12-22 00:00:00",
    "text": "Wishing you an amazing festive period! \nOne filled with laughter, special memories and joyous times.\nHappy holidays from some of our most talented Dayforce elves and I.\n\nAmanda Hawley Tobias W. Goers ツSam DennisonLyndon Davies\n#makeworklifebetter"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7409153529006936064/",
    "post_id": 7409153529006936064,
    "engagements": 24,
    "impressions": 1556,
    "comments": 1,
    "reposts": 0,
    "reactions": 23,
    "engagement_rate": 1.54,
    "post_format": "Text Only",
    "posted_at": "2025-12-23 00:00:00",
    "week": "2025-12-22 00:00:00",
    "text": "Your workforce system costs more than you think it does.\n\nYou can calculate the invoice cost. Software licenses, implementation fees, support contracts. That's the easy part.\n\nThe real cost is hidden in the operational friction nobody tracks or includes in budgets.\n\n→ Leaders spending the first two hours of their day validating reports before they trust them enough to use them. \n\n→ HR teams building manual workarounds to patch gaps between systems that should talk to each other but don't. \n\n→ Employees waiting hours or days for answers to simple questions. \n\n→ IT maintaining integrations that break every time someone updates anything.\n\nNone of these moments looks dramatic on its own. Together, they drain time, morale, and operational efficiency in ways that never show up on a budget line, but absolutely show up in your results.\n\nThis is why unified workforce systems matter. Not because they're more convenient or easier to use, but because organisations genuinely function better when they aren't constantly stitching together the basics.\n\nThe companies I see moving fastest right now are the ones systematically removing layers of unnecessary complexity.\n\nFewer systems to check, fewer exceptions to manage, and fewer surprises landing at 4pm on a Friday when nobody has bandwidth left to deal with them."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7416828278642196480/",
    "post_id": 7416828278642196480,
    "engagements": 200,
    "impressions": 6404,
    "comments": 17,
    "reposts": 0,
    "reactions": 183,
    "engagement_rate": 3.12,
    "post_format": "Text Only",
    "posted_at": "2026-01-13 00:00:00",
    "week": "2026-01-12 00:00:00",
    "text": "We had a strong year at Dayforce EMEA.\n\nThe numbers matter, but what I'm most proud of isn't just the growth, it's how we got there:\n\nA significant portion of our team exceeded their targets. It means our people are winning individually, not just the business as a whole. \n\nThat makes me incredibly proud, and the difference came down to a few things we did deliberately.\n\nWe got clear on who we serve and why. Not trying to be everything to everyone, just deep focus on complex organisations where we can deliver real value.\n\nWe built teams who understand that getting the basics right is what earns credibility. Payroll systems without friction, work schedules that make sense, and a mobile-friendly user experience that make life easier for employees. \n\nThat's the foundation everything else sits on.\n\nWe listened carefully to what customers needed, not just what we wanted to sell. The conversations that matter most usually aren't about software, they're about how work actually happens on the ground.\n\nAnd we invested in the right people. We promoted from within. We brought in new talent. We made sure successful people were helping newer people get there too.\n\nThere's still a lot ahead. The bar is high for this year, and we're ready for it.\n\nBut this is the kind of growth that lasts, not because it's loud, but because it's grounded in teams who trust each other and customers who trust us.\n\nLooking forward to the 2026 year!"
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7417127183514763264/",
    "post_id": 7417127183514763264,
    "engagements": 31,
    "impressions": 1440,
    "comments": 1,
    "reposts": 0,
    "reactions": 30,
    "engagement_rate": 2.15,
    "post_format": "Text Only",
    "posted_at": "2026-01-14 00:00:00",
    "week": "2026-01-12 00:00:00",
    "text": "The businesses I work with aren't always scaling fast or going through major disruption.\n\nSome of the most complex workforce environments I see exist inside companies that look completely stable from the outside.\n\nWhat changes often isn't simple headcount, it's context.\n\nMore flexible working patterns, tighter regulations, and higher expectations from employees. Multiple sites operating at different rhythms. Greater scrutiny around pay equity and compliance.\n\nAll of it often layered over systems that were never designed to work together.\n\nIndividually, none of these changes look dramatic, but together, they fundamentally change how work needs to be managed.\n\nThis is why workforce conversations are evolving. \nThey're no longer just about efficiency. They're about resilience.\n\nCan your teams adapt when conditions shift? Can leaders trust the data they're using? Can HR focus on people instead of reconciling systems?\n\nThe companies handling this best aren't doing anything flashy. They're simplifying where it matters most - at the foundation.\n\nBecause stability today doesn't mean standing still. \n\nIt means being able to move without friction, knowing that you’ve got an integrated, all-in-one system in place which is designed for scaling (a system like Dayforce)."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7417530930526998530/",
    "post_id": 7417530930526998530,
    "engagements": 33,
    "impressions": 1542,
    "comments": 0,
    "reposts": 0,
    "reactions": 33,
    "engagement_rate": 2.14,
    "post_format": "Text Only",
    "posted_at": "2026-01-15 00:00:00",
    "week": "2026-01-12 00:00:00",
    "text": "Working with different companies in the corporate world over the span of my career had a few unexpected surprises. \n\nI expected the physical pace - that wasn't the surprising part: \n\nWhat struck me was how many small, seemingly minor moments determined whether the entire day felt manageable or completely exhausting for the people doing the work.\n\nA supervisor who could answer questions without having to check three different systems first. Equipment that actually worked when they needed it, not just \"most of the time.\" \n\nClear priorities when two urgent things happened at once, instead of conflicting messages from different managers. Visibility into their own performance so they knew if they were on track or falling behind.\n\nFrontline work leaves almost no room for friction.\n\nWhen the basics run smoothly, people feel it immediately, and performance follows. When they don't, the whole operation carries the weight. And it's almost always the frontline teams who absorb the impact first and feel it hardest.\n\n\"Better work\" isn't some abstract future-state concept.\n\nIt's the sum of dozens of small, concrete improvements. The things that make a shift smoother, a team more confident, and a leader more present for what actually matters instead of buried in admin.\n\nAs we expand Dayforce across EMEA, this stays at the absolute center of everything we're building.\n\nWorkforce technology can support people in incredibly powerful ways, but only if it respects the reality of their day. Only if it removes friction instead of creating more of it.\n\nThat's the standard we're holding ourselves to. \n\nIf you think your operation needs to do better, let’s talk. I’d love to hear what’s hurting your frontline the most."
  },
  {
    "post_url": "https://www.linkedin.com/feed/update/urn:li:activity:7417875631364825088/",
    "post_id": 7417875631364825088,
    "engagements": 18,
    "impressions": 890,
    "comments": 2,
    "reposts": 0,
    "reactions": 16,
    "engagement_rate": 2.02,
    "post_format": "Text Only",
    "posted_at": "2026-01-16 00:00:00",
    "week": "2026-01-12 00:00:00",
    "text": "One of the clearest signs a workforce system isn't working is when people spend more time working around it than with it.\n\nThe workarounds usually start small. \nThen they become normal. \nThen they become invisible.\n\nOver time, they tend to create drag.\n\nIn most cases, manual workarounds pull leadership attention away from what actually matters. They make change feel heavier than it needs to be, and they slow down work that should be running smoothly.\n\nStrong workforce systems don't eliminate judgment, they reduce unnecessary effort so judgment can go where it's actually needed.\n\nIt’s probably one of the strongest use cases I could offer you for implementing Dayforce. We have an all-in-one approach to WFM which eliminates the need for multiple databases, and multiple systems. \n\nThat way, we can end the risks of needing dozens of cobbled-together workarounds to make everything work, leaving space for your teams to think ahead instead of catching up constantly. \n\nThe companies I see scaling well aren't the ones with perfect systems. They're the ones systematically removing these layers of friction. Not all at once, but deliberately.\n\nBecause if your teams erased every workaround tomorrow, the question is simple: would things feel calmer, or would they fall apart?\n\nThat usually tells you whether your foundation is supporting growth or quietly holding it back.\n\nI’d love to hear some of the manual workaround horror stories you’ve seen over the years down below. I’m sure there are a few crazy examples out there!"
  }
]